bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
/*
      Tiny Robot Code, v0.5
      by Bill Weiler

      Segger Embedded Studio - full version is free for Nordic chips, using ARM M version v3.34
      Segger J-Link EDU or Adafruit J-Link - okay for learning
      Nordic nRF5 SDK v14.2
      Nordic SDK BLE_Peripheral_Template and nRF Blinky example used as starting point 
      CMSIS DSP Library
      Nordic chip: nRF52832 QFN48 AA
      nRF52832 runs at 64Mhz, has 512k flash and 64k SRAM, and hardware single precision floating point
      Nordic BLE Stack is called Softdevice and only comes in hex form, I'm using S132 v5.0.0

      Targets for this code are Tiny Robot and Sparkfun nRF52832 reference design used for test rigs
      Tiny Robot has these features:
      1. VLX6180 distance sensor through i2c
      2. 2 motors, left and right, driven through 2 TI DRV8834. The DRV's are driven by gpio's
      3. Microphone through PDM peripheral that outputs PCM signed 16bit mono audio
      4. Buzzer through PWM1 peripheral
      5. 1 LED through gpio, active low (clearing it (0) turns led on)
      6. BLE antenna, s132 supports central and peripheral, observer and broadcaster, total 20 connections (that's 19 robots and a cellphone!)

      There is no crystal LF oscillator in Tiny Robot, the softdevice uses the internal RC oscillator, 
      there is a 32Mhz crystal HF oscillator for the CPU

      Watch out modifying code, the BLE stack takes peripherals and scheduling. Notably it takes Timer0, some flash and ram, and a lot of cpu cycles. If you
      have problems, use their API for scheduling time slots. Check the Softdevice documentation for blocked peripherals.

      Motors are bi-polar steppers. The datasheet says they don't like microstepping. I see mode 1 and 2 work okay.
      Also a step is 18 degrees, about 1.67mm of travel. Microstepping is weird, so not linear going from 1/4 to 1/8.
      Just doubling steps might not work.
      Minimum freq for full-step seems to be 200
      Maxmimum frew full-step for starting is 800

      For true hardware floating point, GCC is not always smart enough, you can use idioms or intrinsics, 
      or just check disassembly to make sure FPU instructions were used.

      For understanding firmware to master it, read this stuff:
      1. nRF52832 datasheet, watch out for old versions, like on Sparkfun, I am using v1.4
      2. Nordic Softdevice Specification
      3. Nordic Errata (skim, too boring)
      4. Nordic Softdevice API - online only
      5. Nordic devzone forums
      6. Nordic Compatability list (really boring but skim)
      7. ST VLX6180 datasheet (some tricks you can do)
      8. Knowles Microphone datasheet - The datasheet is minimally useful, it just has specs. I would read stuff about PDM and PCM. 
         You can trigger microphone recording and grab the raw PCM audio out of the Segger IDE memory view and then export to your PC. 
         You can then play it in Audacity (Audacity is free).
         Audacity gotcha is, the file extension must be .wav, not the .bin Segger writes by default.
*/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "sdk_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "fds.h"
#include "peer_manager.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "arm_const_structs.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_pwm.h"
#include "nrf_timer.h"
#include "nrf_uarte.h"    
#include "vl6180.h"
#include "nrf_drv_pdm.h"

//COMMAND SET FOR BLE
#define MOTORS_RIGHT      0x10
#define MOTORS_LEFT       0x11
#define MOTORS_FORWARD    0x12
#define MOTORS_BACKWARD   0x13
#define MOTORS_STOP       0x14
#define MOTORS_SLEEP      0x15
#define INC_STEP_MODE     0x16
//DEC not in Android yet
#define DEC_STEP_MODE     0x18
#define PLAY_BUZZER       0x17

#define GET_DISTANCE      0x22
#define GET_AMBIENT       0x21

#define RECORD_SOUND      0x30
#define INCREASE_GAIN     0x31
#define DECREASE_GAIN     0x32

#define ROVER_MODE        0x40
/*
    Conditional compilation
    ========================================================
    MB_TEST = mainboard (also called FB) tester
    SPARKFUN 1 = Sparkfun reference used for testing daugtherboard (also called BB)
    SPARTFUN 0 = Tiny Robot firmware
    ADHOC_TEST = ad hoc test - targeted for debugging a specific thing
    MOTORS_STEPPING_PWM = enables PWM functions for use in stepping, you must disable gpio/timer1
*/
#define MB_TEST     0
#define MICROPHONE  0
#define SPARKFUN    0

#define ADHOC_TEST  0
#define MOTORS_STEPPING_PWM 0
#if MB_TEST
#define SPARKFUN 0
#endif

#if SPARKFUN

#define UART_RX_PIN   26
#define UART_TX_PIN   27
#define SLEEP         18
#define DIR_R         19
//actually red
#define GREEN_LED     7

#else

#define UART_RX_PIN   12
#define UART_TX_PIN   11
#define SLEEP         27
#define DIR_R         26
#define GREEN_LED     2

#endif

//Buzzer
#define BUZZER_10MM   8

//microphone
#define MIC_CLK       28
#define MIC_DI        29

//VLX6180
#define GP0           14
#define GP1           13
#define I2C0_SCL      15
#define I2C0_SDA      16

//motors
#define M1            25
#define M0            23
#define DIR_L         22
#define STEP          30

//stepping modes
#define FULL_STEP     0
#define HALF_STEP     1
#define QUARTER_STEP  2
#define n8_STEP       3
#define n16_STEP      4
#define n32_STEP      5

//BLE defines, refactored from SDK
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2    /**< Reply when unsupported features are requested. */

#define DEVICE_NAME                     "Skoobot"                               /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "William Weiler Eng"                    /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_ADV_INTERVAL                64                                      /**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED   /**< The advertising time-out (in units of seconds). When set to 0, we will never time out. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)        /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory time-out (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000)                  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

