bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
void ble_skoobot_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);
#define BLE_SKOOBOT_DEF(_name)                                                 \
static uint8_t _name;                                                       \
NRF_SDH_BLE_OBSERVER(_name ## _obs,                                         \
                     2,                                                     \
                     ble_skoobot_on_ble_evt, &_name)

//stole these from Nordic Blinky app
#define LBS_UUID_BASE        {0x23, 0xD1, 0xBC, 0xEA, 0x5F, 0x78, 0x23, 0x15, \
                              0xDE, 0xEF, 0x12, 0x12, 0x00, 0x00, 0x00, 0x00}
#define LBS_UUID_SERVICE     0x1523
#define LBS_UUID_DATA_CHAR   0x1524
#define LBS_UUID_CMD_CHAR    0x1525

BLE_SKOOBOT_DEF(m_skoobot);
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */

// BLE Data, declare and Initialize
//cmd is from phone to robot, data is from robot to phone
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */
uint8_t g_inbyte = 0;
uint16_t svc_handle;
ble_gatts_char_handles_t data_handle, cmd_handle;
uint8_t uuid_type;
uint8_t cmd_value = 0, data_value = 0, BLE_Connected = 0, new_cmd = 0;  
//BLE prototype functions
static void timers_init(void);
static void log_init(void);
static void ble_stack_init(void);
static void gap_params_init(void);
static void gatt_init(void);
static void services_init(void);
static void advertising_init(void);
static void conn_params_init(void);
static void advertising_start(void);
static uint32_t add_cmd_characteristic(void);
static uint32_t add_data_characteristic(void);
uint32_t update_remote_byte(void);    //sends uint8_t data_value
void ble_skoobot_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);

//FFT defines
#define GRAPH_WINDOW_HEIGHT              20                              //!< Graph window height used in draw function.
#define FPU_EXCEPTION_MASK               0x0000009F                      //!< FPU exception mask used to clear exceptions in FPSCR register.
#define FPU_FPSCR_REG_STACK_OFF          0x40                            //!< Offset of FPSCR register stacked during interrupt handling in FPU part stack.
// We want to use 44100 Hz sampling rate to reach 22050Hz band. 128 (64 pairs) samples are used
// in FFT calculation with result contains 64 bins (22050Hz/64bins -> ~344,5Hz per bin).
#define FFT_TEST_SAMPLE_FREQ_HZ          44100.0f                        //!< Frequency of complex input samples.
#define FFT_TEST_COMP_SAMPLES_LEN        128                             //!< Complex numbers input data array size. Correspond to FFT calculation this number must be power of two starting from 2^5 (2^4 pairs) with maximum value 2^13 (2^12 pairs).
//#define FFT_TEST_OUT_SAMPLES_LEN         (FFT_TEST_COMP_SAMPLES_LEN / 2) //!< Output array size.
//#define SIGNALS_RESOLUTION               100.0f                          //!< Sine wave frequency and noise amplitude resolution. To count resolution as decimal places in number use this formula: resolution = 1/SIGNALS_RESOLUTION .
//#define SINE_WAVE_FREQ_MAX               20000                           //!< Maximum frequency of generated sine wave.
//#define NOISE_AMPLITUDE                  1                               //!< Amplitude of generated noise added to signal.
static uint32_t  m_ifft_flag             = 0;                            //!< Flag that selects forward (0) or inverse (1) transform.
static uint32_t  m_do_bit_reverse        = 1;                            //!< Flag that enables (1) or disables (0) bit reversal of output.
#define FFT_TEST_COMP_SAMPLES_LEN        128    
static float32_t m_fft_input_f32[FFT_TEST_COMP_SAMPLES_LEN];             //!< FFT input array. Time domain.
static float32_t m_fft_output_f32[FFT_TEST_COMP_SAMPLES_LEN];             //!< FFT output data. Frequency domain.
static int32_t p_out_buffer[FFT_TEST_COMP_SAMPLES_LEN/2+1];
void do_dft(void);

//Microphone
#define SAMPLE_BUFFER_CNT 16*1024
int16_t p_rx_buffer[SAMPLE_BUFFER_CNT];
uint8_t mic_gain = NRF_PDM_GAIN_DEFAULT;
volatile bool m_xfer_done = false;
void configure_microphone(void);
void audio_handler(nrf_drv_pdm_evt_t const * const evt);                //Just sets xfer_done

//Distance sensor
#define TWI_INSTANCE_ID 0
const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);
void configure_VLX6180(void);
void VLX6180_init(void);
void twi_init(void);

//UART
uint8_t sendbuffer[64];
uint8_t recvbuffer[64];
void uart_init(void);
void sendbytes(uint8_t a);
void TxUART(uint8_t* buf);

//Motors
uint8_t timer1_enabled_for_motors = 0, step_loop_done = 0;;
uint32_t timer1_counter, timer1_match_value, timer1_toggle_step;
void motors_forward();
void motors_backward(void);
void motors_right(void);
void motors_left(void);
void turn_left_90_degrees(void);
void pwm_motor_stepping(uint32_t steps_per_second, uint32_t number_steps);
void stop_stepping(void);
void stepping_mode(uint8_t mode);
void step_mode_experiment(void);
void motors_sleep(void);
void motors_wake(void);
void start_stepping_gpio(uint16_t freq);
void stop_stepping_gpio(void);

//Buzzer
uint8_t buzzer_loops_done = 1, song_playing = 0;
void pwm_buzzer_frequency(float freq, uint32_t loops);
void stop_buzzer(void);
//This song feature isn't done
struct notes_struct {
  float32_t freq;
  uint16_t duration;
};
struct song_struct {
  uint16_t num_notes; 
  struct notes_struct *notes;
} song;

//General
void my_configure(void);
void bb_test(void);
void adhoc_robot_test(void);
void mb_test(void);
void led_off(void);
void led_on(void);
void rover(uint32_t freq);        //inherits freq and stepping mode from main()

//Entry point of firmware
int main(void)
{
    uint8_t step_mode = HALF_STEP, counter = 0;
    uint32_t freq = 100, steps = 200, i;
    float32_t ambient_value;
    static uint8_t range, buf[64], distance, callonce;
    struct notes_struct basic[4] = { 440.0, 100, 470.0, 100, 2600.0, 200, 1000.0, 500 };
    song.num_notes = 3;
    song.notes = basic;
 
    nrf_gpio_cfg_output(GREEN_LED);
    led_off();
    my_configure();           //sets gpios and PWM0 for step, PWM1 for buzzer
    motors_sleep();
    stepping_mode(step_mode); //start at step mode 1
     
    uart_init();
    
