bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
    #if MICROPHONE
      configure_microphone();
    #endif
    #if SPARKFUN == 0
      configure_VLX6180();
      #if MB_TEST
        mb_test();
      #endif
    #endif

    // Initialize.
    timers_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    advertising_start();

    #if MICROPHONE
    //like 6700 samples in p_rx_buffer
    m_xfer_done = false;
    nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
    nrf_pdm_gain_set(NRF_PDM_GAIN_MAXIMUM,NRF_PDM_GAIN_MAXIMUM);
    nrf_pdm_event_clear(NRF_PDM_EVENT_END);
    nrf_drv_pdm_start();
    while( nrf_pdm_event_check(NRF_PDM_EVENT_END) == false );
    //nrf_pdm_task_trigger(NRF_PDM_TASK_STOP);
    nrf_drv_pdm_stop();
    do_dft();            //do fft, then check m_fft_output_f32 64 bytes
    for(i=0;(i<SAMPLE_BUFFER_CNT);i++)
    { 
     sprintf(buf,"%d,",p_rx_buffer[i]);
     TxUART(buf);
     nrf_delay_ms(5); 
    }
    #endif
    #if ADHOC_TEST
      adhoc_robot_test();
    #endif
    #if 0
    //SPARKFUN
      bb_test();
    #endif

    //Show user robot is indeed on and ready
    led_on();                         
    pwm_buzzer_frequency(4000.0, 400);    //higher frequencies are louder with this buzzer          
    while(buzzer_loops_done == 0);
    pwm_buzzer_frequency(5000.0, 400);              
    while(buzzer_loops_done == 0);
    pwm_buzzer_frequency(6000.0, 400);              
    while(buzzer_loops_done == 0);
    led_off();

    new_cmd = 0;
    for (;;)
    {
          //Trap here when BLE not connected
          callonce = 1;
          while (BLE_Connected == 0)
          {
            if (callonce == 1)
            {
              stop_buzzer();
              stop_stepping_gpio();
              motors_sleep();
              callonce = 0;
            }
            nrf_delay_ms(200);      //BLE not connected robot heartbeat
            led_on();
            nrf_delay_ms(200);
            led_off();
          }
          if (new_cmd == 2)   //Just test code, write to data_value shouldn't happen
          {
            led_on();
            nrf_delay_ms(500);
            led_off();
            nrf_delay_ms(500);
            led_on();
            nrf_delay_ms(500);
            led_off();
            nrf_delay_ms(500);
          }
          if (new_cmd == 1)
          {
            if (cmd_value != GET_DISTANCE && cmd_value != GET_AMBIENT)
              led_on();
            switch(cmd_value)
            {
            case MOTORS_RIGHT:          //go right 90 degrees
              motors_right();           
              motors_wake();
              start_stepping_gpio(freq);     
              break;
            case MOTORS_LEFT:
              motors_left();
              motors_wake();
              start_stepping_gpio(freq);     
              break;
            case MOTORS_FORWARD:
              motors_forward();
              motors_wake();
              start_stepping_gpio(freq);     
              break;
            case MOTORS_BACKWARD:
              motors_backward();
              motors_wake();
              start_stepping_gpio(freq);     
              break;
            case MOTORS_STOP:
              stop_stepping_gpio();
              motors_sleep();
              break;
            case ROVER_MODE:
              rover(freq);
              break;
            case MOTORS_SLEEP:
              motors_sleep();
              break;
            case PLAY_BUZZER:
              if(buzzer_loops_done == 1)
                pwm_buzzer_frequency(4000.0, 500);              
              break;
            case INC_STEP_MODE:
              motors_sleep();
              ++step_mode;
              if (step_mode == 6)
              {
                step_mode = 0;
              }
              switch(step_mode)
              {
                case FULL_STEP:
                  freq = 100;
                  break;
                case HALF_STEP:
                  freq = 200;
                  break;
                case QUARTER_STEP:
                  freq = 300;
                  break;
                case n8_STEP:
                  freq = 400;
                  break;
                case n16_STEP:
                  freq = 800;   //max
                  break;
                case n32_STEP:
                  freq = 1600;
                  break;
              }
              stepping_mode(step_mode);
              data_value = step_mode;
              update_remote_byte();
              break;
            case DEC_STEP_MODE:
              motors_sleep();
              if (step_mode != 0)
              {
                --step_mode;
              }
              switch(step_mode)
              {
                case FULL_STEP:
                  freq = 100;
                  break;
                case HALF_STEP:
                  freq = 200;
                  break;
                case QUARTER_STEP:
                  freq = 300;
                  break;
                case n8_STEP:
                  freq = 400;
                  break;
                case n16_STEP:
                  freq = 800;   //max
                  break;
                case n32_STEP:
                  freq = 1600;
                  break;
              }
              stepping_mode(step_mode);
              data_value = step_mode;
              update_remote_byte();
              break;
            case GET_DISTANCE:
              data_value = getDistance();
              update_remote_byte();
              break;
            case GET_AMBIENT:
              ambient_value = getAmbientLight(GAIN_5);      //indoors LUX is likely 10-1000
              data_value = ambient_value;                   //single byte won't cut it
              update_remote_byte();
              break;
            case RECORD_SOUND:
              m_xfer_done = false;
              nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
              nrf_pdm_gain_set(NRF_PDM_GAIN_MAXIMUM,NRF_PDM_GAIN_MAXIMUM);
              nrf_pdm_event_clear(NRF_PDM_EVENT_END);
              nrf_drv_pdm_start();
              while( nrf_pdm_event_check(NRF_PDM_EVENT_END) == false );
              nrf_drv_pdm_stop();
              do_dft();            //do fft, then check m_fft_output_f32 64 bytes
              ++counter;
              data_value = counter;
              update_remote_byte();
              break;
            case INCREASE_GAIN:
              mic_gain += 5;
              if (mic_gain > NRF_PDM_GAIN_MAXIMUM)
                mic_gain = NRF_PDM_GAIN_MAXIMUM;
              nrf_pdm_gain_set(mic_gain,mic_gain);
              data_value = mic_gain;
              update_remote_byte();
              break;
            case DECREASE_GAIN:
              if (mic_gain < NRF_PDM_GAIN_MINIMUM+5)
                  mic_gain = NRF_PDM_GAIN_MINIMUM;
              else
                  mic_gain -= 5;
              nrf_pdm_gain_set(mic_gain,mic_gain);
              data_value = mic_gain;
              update_remote_byte();
              break;
           default:
               break;
          }
          new_cmd = 0;
      }
      else
      {
        led_off();
        //play_song();
      }
   }  
}

//This is bug specific, please ignore
void adhoc_robot_test(void)
{
    motors_backward();
    motors_wake();
    start_stepping_gpio(100);
    while(1) 
    {
       if (new_cmd == 1)
       {
          switch(cmd_value)
          {
            case MOTORS_FORWARD:
              motors_forward();
              break;
            case MOTORS_BACKWARD:
              motors_backward();
              break;
            case MOTORS_STOP:
              stop_stepping_gpio();
              motors_sleep();
              break;
            default:
              motors_wake();
              stop_stepping_gpio();     //make sure stopped before re-starting
              start_stepping_gpio(100);
              break;
          }
          new_cmd = 0;
      }
      nrf_delay_ms(500);
      led_on();
      nrf_delay_ms(500);
      led_off();
    }
}

void bb_test(void)
{
    motors_backward();
    motors_wake();
    start_stepping_gpio(100);
    while(1) 
    {
       if (new_cmd == 1)
       {
          switch(cmd_value)
          {
            case MOTORS_FORWARD:
              motors_forward();
              break;
            case MOTORS_BACKWARD:
              motors_backward();
              break;
            case MOTORS_STOP:
              stop_stepping_gpio();
              motors_sleep();
              break;
            default:
              motors_wake();
              stop_stepping_gpio();     //make sure stopped before re-starting
              start_stepping_gpio(100);
              break;
          }
          new_cmd = 0;
      }
      nrf_delay_ms(500);
      led_on();
      nrf_delay_ms(500);
      led_off();
    }
}

//Inherits stepping mode and freq from main()
void rover(uint32_t freq)
{
  uint8_t distance;

