bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
  motors_forward();
  motors_wake();
  start_stepping_gpio(freq);       
  new_cmd = 0;
  while(new_cmd == 0)
  {
      distance = getDistance();
      if (distance < 50)
      {
        led_on();
        motors_left();
      }
      else
      {
        motors_forward();
        led_off();
      }
      nrf_delay_ms(50);
  }
  stop_stepping_gpio();
  motors_sleep();
  motors_forward();
  return;
}

//This isn't done
void play_song(void)
{
    static uint8_t i = 0;

    if (buzzer_loops_done == 0)
      return;

    pwm_buzzer_frequency(song.notes[i].freq,song.notes[i].duration);
    if (i == song.num_notes-1)
      i = 0;
    else  
      ++i;
}

//orphaned function, obsolete
void turn_left_90_degrees(void)
{
  motors_left();            //turn left
  motors_wake();
  start_stepping_gpio(50);   
  nrf_delay_ms(100);        //this should be 5 steps each motor for 90 degree turn
  stop_stepping_gpio();          //if it doesn't work I'll try doing 5 steps manually
  motors_sleep();
}

//Left channel mono configured, continuous int16, no alternating right channel
void configure_microphone(void)
{

  nrf_drv_pdm_config_t pdm_config = NRF_DRV_PDM_DEFAULT_CONFIG(MIC_CLK,MIC_DI);

  pdm_config.clock_freq = NRF_PDM_FREQ_1032K;
  pdm_config.mode = NRF_PDM_MODE_MONO;
  pdm_config.edge = NRF_PDM_EDGE_LEFTRISING;
  pdm_config.gain_l = mic_gain;
  pdm_config.gain_r = mic_gain;

  nrf_drv_pdm_init(&pdm_config, audio_handler);
 
  return; 
}

//This is obsolete
void step_mode_experiment(void)
{
    uint8_t stepmode, cnt_of_trys;
    uint32_t freq;

    motors_sleep();
    for (cnt_of_trys=0;(cnt_of_trys<5);cnt_of_trys++)
    {
        freq = 40;
        for(stepmode=0;(stepmode<6);stepmode++)
        {
            stepping_mode(stepmode);
            motors_forward();           
            start_stepping_gpio(100);
            if (freq == 40)
              led_on();                 //mark start of test
            else
              led_off();
            motors_wake();
            nrf_delay_ms(2000);
            stop_stepping_gpio();
            motors_sleep();
            nrf_delay_ms(500);
            freq *= 2;
        }
    }
    return;
}

inline void led_off(void)
{
    nrf_gpio_pin_set(GREEN_LED);
}

inline void led_on(void)
{
    nrf_gpio_pin_clear(GREEN_LED);
}

inline void motors_sleep(void)
{
    nrf_gpio_pin_clear(SLEEP);
}

inline void motors_wake(void)
{
    nrf_gpio_pin_set(SLEEP);
    nrf_delay_us(1000);       //delay 1ms for DRV to reset
}

void motors_forward()
{
  nrf_gpio_pin_clear(DIR_L);
  nrf_gpio_pin_set(DIR_R);   
}

void motors_backward(void)
{
   nrf_gpio_pin_set(DIR_L);
   nrf_gpio_pin_clear(DIR_R);
}

void motors_right(void)
{
   nrf_gpio_pin_clear(DIR_L);
   nrf_gpio_pin_clear(DIR_R);
}

void motors_left(void)
{
   nrf_gpio_pin_set(DIR_L);
   nrf_gpio_pin_set(DIR_R);
}

void stepping_mode(uint8_t mode)
{
    switch(mode)
    {
        case FULL_STEP:     //full step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_clear(M1);
          break;
        case HALF_STEP:     //1/2 step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M0);
          nrf_gpio_pin_clear(M1);
          break;
        case QUARTER_STEP:     //1/4 step
          nrf_gpio_cfg_input(M0,NRF_GPIO_PIN_NOPULL);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M1);
          break;
        case n8_STEP:     //8 microsteps
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_set(M1);
          break;
       case n16_STEP:     //16 microsteps
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M0);
          nrf_gpio_pin_set(M1);
          break;
       case n32_STEP:     //32 microsteps
          nrf_gpio_cfg_input(M0,NRF_GPIO_PIN_NOPULL);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M1);
          break;
      default:            //full step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_clear(M1);
          break;
    }
}

void configure_VLX6180(void)
{
    twi_init();
    VLX6180_init();
}

void VLX6180_init(void)
{
    nrf_gpio_cfg_output(GP0);   //power up is chip enable
    nrf_gpio_pin_set(GP0);
    nrf_gpio_cfg_input(GP1,NRF_GPIO_PIN_NOPULL);    //open drain interrupt
  
    VL6180xInit();
    VL6180xDefautSettings();
}

__STATIC_INLINE void data_handler(uint8_t temp)
{

}

void stop_stepping_gpio(void)
{
  nrf_timer_task_trigger(NRF_TIMER1,NRF_TIMER_TASK_STOP);
}

void start_stepping_gpio(uint16_t freq)
{
  nrf_gpio_cfg_output(STEP);
  nrf_gpio_pin_clear(STEP);
 
  timer1_toggle_step = 1;
  timer1_counter = 0;
  timer1_match_value = 2500 / freq;    //does 2 edges, so 5000/2 per sec
  timer1_enabled_for_motors = 1;
  nrf_timer_shorts_enable(NRF_TIMER1,NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK);
  nrf_timer_task_trigger(NRF_TIMER1,NRF_TIMER_TASK_START);    
}

//TIMER1 - this is the motor timer, runs at 200us or 5kHz
void TIMER1_IRQHandler(void)
{
  if (timer1_enabled_for_motors == 1)
  {
    ++timer1_counter;
    if (timer1_counter == timer1_match_value)
    {
       if (timer1_toggle_step == 1)
       {
          nrf_gpio_pin_set(STEP);
          timer1_toggle_step = 0;
       }
       else
       {
          nrf_gpio_pin_clear(STEP);
          timer1_toggle_step = 1;
       }
       timer1_counter = 0;
    }
  }
  nrf_timer_event_clear(NRF_TIMER1,NRF_TIMER_EVENT_COMPARE0);
}

void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {             
                //data_handler(m_sample);
            }
            break;
        default:
            break;
    }
}

void twi_init(void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_VLX6180_config = {
       .scl                = I2C0_SCL,
       .sda                = I2C0_SDA,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_VLX6180_config, NULL, NULL);

    nrf_drv_twi_enable(&m_twi);
}


void audio_handler(nrf_drv_pdm_evt_t const * const evt)
{
   if (evt->buffer_requested == false)
       m_xfer_done = true;
}

#if MOTORS_STEPPING_PWM
//in common mode and refresh mode, number of steps should be even
//wheels with tires travel approximately 1.67mm per step, so 300 steps is 5cm
//a 90 degree turn should be 10 steps
void pwm_motor_stepping(uint32_t steps_per_second, uint32_t number_steps)
{
  volatile static uint16_t pwm_duty[2];
  volatile static uint32_t pwm_top;

